[
  {
    "_id": 123, 
    "repostBy": "Elon Musk",
    "avatarIcon": "tesla-logo.jpg",
    "userName": "Tesla",
    "handle": "tesla",
    "time": "2h", 
    "topic": "Cybertruck", 
    "title": "Tesla Cybertruck lands on Mars and picks up the Curiosity rover on its 6' bed",
    "tuit": "An autopilot is a system used to control the path of an aircraft, marine craft or spacecraft without requiring constant manual control by a human operator. Autopilots do not replace human operators. Instead, the autopilot assists the operator's control of the vehicle, allowing the operator to focus on broader aspects of operations.",
    "replies": 123,
    "retuits": 432,
    "likes": 2345,
    "liked": true
  },
  { 
    "_id": 234, 
    "avatarIcon": "spacex-logo.jpg",
    "userName": "SpaceX",
    "handle": "SpaceX",
    "time": "2h", 
    "topic": "Space", 
    "title": "100s of SpaceX Starships land on Mars after a 6 month journey. 1000s of Martian colonists being building Mars Base 1",
    "tuit": "You want to wake up in the morning and think the future is going to be great - and that's what being a spacefaring civilization is all about. It's about believing in the future and thinking that the future will be better than the past. And I can't think of anything more exciting than going out there and being among the stars.",
    "link": "www.spacex.com",
    "image": "spacex.jpg",
    "replies": 234,
    "retuits": 543,
    "likes": 3456,
    "liked": false
  },
  { 
    "_id": 345, 
    "avatarIcon": "tesla-logo.jpg",
    "userName": "Tesla",
    "handle": "tesla",
    "time": "4d", 
    "topic": "Energy", 
    "title": "Tesla FSD finally makes driving obsolete. After years of delay, Tesla Full Self Driving can drive you to work while you work, play, or sleep",
    "tuit": "You want to wake up in the morning and think the future is going to be great - and that's what being a spacefaring civilization is all about. It's about believing in the future and thinking that the future will be better than the past. And I can't think of anything more exciting than going out there and being among the stars.",
    "replies": 345,
    "retuits": 321,
    "likes": 1234,
    "liked": true,
    "showThread" : true 
  },
  { 
    "_id": 456, 
    "avatarIcon": "react-tweet.jpg", 
    "userName": "ReactJS",
    "handle": "ReactJS",
    "time": "2h", 
    "topic": "Web Development", 
    "title": "React.js is a component based front end library that makes it very easy to build Single Page Applications or SPAs",
    "tuit": "React (also known as React.js or ReactJS) is a free and open-source front-end @JavaScript library for building user interfaces based on components. It is maintained by Meta (formerly Facebook) and a community of individual developers and companies. React can be used as a base in the development of single-page, mobile, or server-rendered applications with frameworks like Next.js. However, React is only concerned with the user interface and rendering components to the DOM, so creating React applications usually requires the use of additional libraries for routing, as well as certain client-side functionality.",
    "replies": 485,
    "retuits": 301,
    "likes": 1343,
    "liked": false
  },
  { 
    "_id": 567, 
    "avatarIcon": "javascript-tweet.jpg", 
    "userName": "JavaScript",
    "handle": "JavaScript",
    "time": "1d", 
    "topic": "Web Development", 
    "title": "JavaScript is programming language that can run on browsers as well as desktops",
    "tuit": "JavaScript, often abbreviated as JS, is an interpreted programming language that conforms to the ECMAScript specification. JavaScript is high-level, often just-in-time compiled, and multi-paradigm. It has curly-bracket syntax, dynamic typing, prototype-based object-orientation, and first-class functions.",
    "replies": 673,
    "retuits": 385,
    "likes": 7777,
    "liked": false
  }
]